notes/dld.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Digital Logic and System</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Digital Logic and System</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb3b28d1">Logic Gates</a></li>
<li><a href="#org88a87ac">Digital Families</a>
<ul>
<li><a href="#org116855c">Bipolar Families</a>
<ul>
<li><a href="#orgcb0c0d2">Saturated Bipolar Logic Family</a></li>
<li><a href="#org2b019dd">Unsaturated bipolar logic family</a></li>
</ul>
</li>
<li><a href="#org8ba6e97">MOS Families</a></li>
<li><a href="#orgf227c68">Characteristics of Digital ICs</a></li>
</ul>
</li>
<li><a href="#orgb8a3256">LINKS</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb3b28d1" class="outline-2">
<h2 id="orgb3b28d1">Logic Gates</h2>
<div class="outline-text-2" id="text-orgb3b28d1">
<p>
A electronic circuit that has two or more inputs but only one output. 
</p>

<p>
A --&#x2013;&#x2014;&gt; 
B --&#x2013;&#x2014;&gt;    D   ----&#x2013;&#x2014;&gt; output
C --&#x2013;&#x2014;&gt; 
</p>
</div>
</div>


<div id="outline-container-org88a87ac" class="outline-2">
<h2 id="org88a87ac">Digital Families</h2>
<div class="outline-text-2" id="text-org88a87ac">
<p>
A logic family is a collectin of different integrated circuit chips that have similar input, output, and internal circuit characerisctcs buty they perform different logic gate functions such as AND, OR, NOT, etc.
The two basic techniques for manufacturing ICs are: 
</p>
<ul class="org-ul">
<li>Bipolar Technology</li>
<li>Metal oxide semiconductor (MOS) Technology</li>
</ul>
</div>
<div id="outline-container-org116855c" class="outline-3">
<h3 id="org116855c">Bipolar Families</h3>
<div class="outline-text-3" id="text-org116855c">
<p>
The bipolar families of logic circuits are constructed from bipolar transistors on the chip. There are three basic families in this category: 
</p>
<ul class="org-ul">
<li>Diode transistor logic(DTL) uses diodes and transistors</li>
<li>Transistor Transistor logic(TTL) uses transistors exclusively, popular in SSI and MSI</li>
<li>Emitter coupled logic(ECL) is the fastest logic family which is used for high-speed application.</li>
</ul>
</div>
<div id="outline-container-orgcb0c0d2" class="outline-4">
<h4 id="orgcb0c0d2">Saturated Bipolar Logic Family</h4>
<div class="outline-text-4" id="text-orgcb0c0d2">
<p>
In this they are driver into saturation, it is used at the switch and operated in the saturation and cutoff regions.
</p>
<ol class="org-ol">
<li>Transistor-Transistor Logic(TTL)</li>
<li>Resistor-Transistor Logic(RTL)</li>
<li>Direct Coupled Transistor Logic(DCTL)</li>
<li>Diode Transistor Logic(DTL)</li>
<li>High Threshold Logic(HTL)</li>
<li>Integrated Injection Logic(IIL)</li>
</ol>
</div>
</div>
<div id="outline-container-org2b019dd" class="outline-4">
<h4 id="org2b019dd">Unsaturated bipolar logic family</h4>
<div class="outline-text-4" id="text-org2b019dd">
<p>
In this family the transistor used in IC is not driven into saturation, this increases the speed of operation.
</p>
<ol class="org-ol">
<li>Schottky TTL</li>
<li>Emitter Coupled Logic(ECL)</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org8ba6e97" class="outline-3">
<h3 id="org8ba6e97">MOS Families</h3>
<div class="outline-text-3" id="text-org8ba6e97">
<ul class="org-ul">
<li>The MOS family fabricates the MOS field effect transistors(MOSFETS)</li>
<li>There are 3 logic families PMOS(p-channel MOSFETS), NMOS(n-channel MOSFET) and CMOS(Complementary MOSFET) family.</li>
<li>PMOS is the oldest and slowest while NMOS is used for LSI for microprocessors and memories.</li>
<li>CMOS uses a push-pull arrangement of n-channel and p-channle MOSFETs is used where low power consumption is a priority such as pocket calculators.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf227c68" class="outline-3">
<h3 id="orgf227c68">Characteristics of Digital ICs</h3>
<div class="outline-text-3" id="text-orgf227c68">
<p>
Various characerisctics of a logic family are given below: 
</p>
<ol class="org-ol">
<li>Operating Speed:</li>
<li>Fan-In: It is defined as the number of input sthat it can handle properly.</li>
<li>Fan-Out: Also known as loading factor, it is defined as the maximum number of standard logic inputs that an output can drive reliably.</li>
<li>Power Dissipation: This is the amount of power dissipated in an IC. It is determined by the current, <i>Icc</i>, that it draws from the <i>Vcc</i> supply. The power P is equal to <i>Vcc/*/Icc</i>, where <i>Icc</i> is the average value of <i>Icc(0)</i> and <i>Icc(1)</i>. The power is specified in mW.</li>
<li></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgb8a3256" class="outline-2">
<h2 id="orgb8a3256">LINKS</h2>
<div class="outline-text-2" id="text-orgb8a3256">
<p>
<a href="https://www.electricveda.com/digital-electronics/logic-families-in-digital-electronics-ttl-cmos-and-ecl">https://www.electricveda.com/digital-electronics/logic-families-in-digital-electronics-ttl-cmos-and-ecl</a> 
<a href="https://easyelectronics.co.in/classification-and-characteristics-of-logic-families/">https://easyelectronics.co.in/classification-and-characteristics-of-logic-families/</a>
<a href="https://electronicspani.com/characteristics-and-comparison-of-digital-ic/">Characteristics and Comparision of digital Ics</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
